docs/supply-chain_ontology.md
```mermaid
classDiagram 
   class BusinessPartner~common~{
   } 
   class ConceptualObject~core~{
   } 
   class PhysicalObject~core~{
   } 
   class SupplyChain~supply-chain~{
       validityPeriodEnd date
       validityPeriodStart date
   } 
   SupplyChain --> PhysicalObject : good
   SupplyChain --> BusinessPartner : recipient
   SupplyChain --> BusinessPartner : supplier
   SupplyChain --|> ConceptualObject

```  
